// 7_2. LSD для long long.
// Дан массив неотрицательных целых 64-битных чисел. Количество чисел не больше 106.
// Отсортировать массив методом поразрядной сортировки LSD по байтам.

#include <iostream>

int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
